---
kind: property
id: P:Autodesk.Revit.DB.SlabEdge.SlabEdgeType
source: html/fd61ed95-0d48-9e46-2dd7-4c8486a4ccce.htm
---
# Autodesk.Revit.DB.SlabEdge.SlabEdgeType Property

Retrieves/set an object that represents the type of the SlabEdge.

## Syntax (C#)
```csharp
public SlabEdgeType SlabEdgeType { get; set; }
```